app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-06 00:22:28.214458"], ["updated_at", "2018-08-06 00:22:28.214458"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-08-06 00:22:28.217292"], ["updated_at", "2018-08-06 00:22:28.217292"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:songs].path, header: true) do |song|
      artist = Artist.find_or_create_by(name: song[1])